
var gameLevel = 1; // 게임레벨
var maxCounter = 10 // 단어갯수
var userPoint = 0; // 점수
var itemCount = 1; // 아이템 카운트 - id값으로 활용
var removeCount = 0; // 삭제한 아이템 갯수 (게임종료 확인)
var wordArr = new Array( // 단어 리스트
    '가구','가난','가능','가능해지다','가득히','가라앉다','가려지다','가령','가로등',
    '가로막다','가로수','가르다','가르침','가만','가만있다','가뭄','가사','가상','가입',
    '가입자','가입하다','가장','가정','가정교사','가치','가치관','가톨릭','가하다','각기',
    '각오','간','간','간격','간부','간섭','간신히','간접','간접적','간판','간편하다','간호',
    '간혹','갇히다','갈등','갈수록','갈증','감각','감다','감독','감동적','감소',
    '감소되다','감소하다','감수성','감싸다','감옥','감정적','감추다','감히','갑','갑작스럽다',
    '값싸다','강남','강도','강력하다','강력히','강렬하다','강변','강북','강사','강수량',
    '강요하다','강의','강의하다','강조','강화하다','갖가지','갖추다','같이하다','갚다','개개인','개국',
    '개다','개미','개발되다','개방','개방되다','개방하다','개별','개선','개선되다','개선하다','개성','객관적',
    '거꾸로','거대하다','거두다','거들다','거듭','거리','거부하다','거액','거절하다','거치다','거칠다','거품',
    '건','건너','건넌방','건네다','건네주다','건드리다','건설','건설되다','건설하다','건전하다','건조','건조하다',
    '걷기','걷다','걷다','걸치다','검사','검토','겁나다','게','게시판','게으르다','겨자','겪다','견해','결과적',
    '결론','결석','결석하다','결승','결심','결코','경계','경고','경고하다','경기','경력','경비','경영하다','경쟁',
    '경쟁력','경제력','경제학','경향','계곡','계좌','계층','고개','고구려','고궁','고급스럽다','고려','고무신',
    '고소하다','고요하다','고작','고전','고집','고집하다','고통스럽다','고함','곡','곡식','곤란하다','곧다','곧이어',
    '곧잘','곧장','골','골고루','골짜기','골치','공개','공개하다','공격','공격하다','공공','공군','공급','공기',
    '공식','공식적','공업','공연되다','공연장','공연하다','공연히','공주','공중','공통','공통되다','공통적','공통점',
    '공포','공해','과','과거','과연','과외','과정','과정','관계되다','관계없이','관계자','관광버스','관념','관람',
    '관람객','관리','관리하다','관습','관심사','관점','관찰','광경','광장','괴로움','괴로워하다','괴롭히다','굉장하다',
    '교내','교대','교복','교사','교시','교양','교외','교육비','교육자','교장','교재','교직','교체','교환하다','교훈',
    '구르다','구별','구별되다','구별하다','구분','구분되다','구분하다','구석','구석구석','구성','구성되다','구성하다',
    '구속','구속되다','구속하다','구역','구입','구입하다','구조','구청','국가적','국내선','국내외','국민적',
    '국사','국산','국왕','국적','국제선','국제적','국제화','국회','군','군사','군사','굳다','굳어지다','굳히다',
    '굶다','굽히다','궁극적','권리','권위','귀가','귀가하다','귀신','귀중하다','귀찮다','귀하다','귓속','규모','규정',
    '균형','귤','그간','그나마','그녀','그놈','그대','그때그때','그래야','그래픽','그러다','그런대로','그럴듯하다','그루',
    '그리로','그리움','그리워하다','그리하여','그사이','그야말로','그이','그저','그저께','그전','그제서야','그제야','그토록',
    '극','극복','극복하다','극작가','극히','근거','근거하다','근교','근래','근로','근본','근본적','근원','근육','긁다','금',
    '금강산','금고','금메달','금세','금액','금지되다','금하다','급격히','급속히','급증하다','급히','긋다',
    '기관','기구','기구','기기','기념','기념일','기념품','기념하다','기능','기능','기다','기대다','기대되다','기도하다',
    '기독교','기둥','기록','기록되다','기막히다','기법','기본적','기성','기성세대','기술자','기술하다','기억되다','기업',
    '기업인','기여','기여하다','기울다','기울이다','기원','기원전','기적','기초적','기초하다','기타','기호','기혼','기획',
    '기후','긴급','긴장감','긴장되다','길어지다','김','김','깊숙이','까다','까먹다','까치','깍두기','깔끔하다','깔다','깔리다',
    '깡패','깨끗해지다','깨닫다','깨달음','깨뜨리다','깨소금','깨어나다','깨어지다','깨우다','꺾다','꼬리','꼬마','꼭','꼴','꼼꼼하다',
    '꼼짝','꼽히다','꽂다','꽃씨','꽉','꾸다','꾸리다','꾸준하다','꾸중','끈','끊기다','끊임없다','끊임없이','끌리다','끌어당기다','끝없다',
    '끝없이','끼','끼어들다','끼우다','나누어지다','나뉘다','나들이','나란히','나르다','나름','나아가다','나아지다','나침반','낚시꾼','낚싯대',
    '난리','난방','날리다','날아다니다','날카롭다','남','남미','남부','남북','납득하다','낭비','낮아지다','낮추다','낱말','내','내과','내다보다',
    '내달','내려지다','내버리다','내보내다','내부','내쉬다','내외','내외','내용물','내적','내주다','내후년','냇물','냉동','냉방','넉','넉넉하다',
    '널리','넘겨주다','넘기다','넘어뜨리다','넘어오다','노동','노선','녹다','녹이다','녹화','논','논리','논리적','논쟁','논하다','놀리다',
    '놈','농민','농부','농사일','농사짓다','농산물','농장','놓아두다','놔두다','뇌','눈가','눈감다','눈길','눈동자','눈뜨다','눈병','눈부시다',
    '늑대','늘어놓다','늘어서다','늘어지다','능동적','늦가을','늦어지다','다가서다','다듬다','다루다','다름없다','다만','다방','다소','다양성',
    '다양해지다','다정하다','다지다','다짐하다','다투다','다툼','다행','닥치다','단','단계','단골','단단하다','단독','단순','단위','단추',
    '단편','단풍','달다','달다','달래다','달려들다','달리','달리기','달리하다','담','담당','담당자','답','답변','당당하다','당분간','당시',
    '당하다','대','대','대','대가','대강','대개','대개','대규모','대기','대기하다','대낮','대다','대다수','대략','대량','대로','대륙',
    '대비하다','대사','대상자','대신하다','대여섯','대응','대응하다','대입','대접','대접하다','대중적','대책','대처하다',
    '대체','대체로','대출','대충','대표하다','대학로','대합실','대형','댐','더더욱','더러워지다','더불다','더욱','더욱더','더욱이','덕','덜다',
    '덧붙이다','덩어리','덮이다','데우다','데이트','도','도달하다','도대체','도덕','도리어','도마','도망','도망치다','도심','도움말','도입','도저히',
    '도전','독감','독립','독립하다','독창적','독특하다','독하다','돌멩이','돌아다니다','동','동그라미','동그랗다','동기','동료','동부','동서',
    '동서남북','동양인','동의','동의하다','동일하다','동작','동포','동행','동화책','되돌리다','되돌아가다','되돌아보다','되돌아오다','되살리다','되찾다',
    '되풀이되다','되풀이하다','두께','두뇌','두드러지다','두려움','두려워하다','두렵다','두르다','두리번거리다','두어','둘러싸다','둘러싸이다','둥지',
    '뒤늦다','뒤따르다','뒤지다','뒤편','뒷골목','뒷모습','뒷문','드디어','드러나다','드물다','들어주다','들여놓다','들이다','들이마시다','들이켜다',
    '듯','듯싶다','듯하다','등등','등록증','등록하다','등장','등장하다','디스크','따님','따라다니다','따라서','따로따로','따스하다','딱','딱딱하다',
    '딸아이','땅바닥','땅속','때','때로','때리다','떠나가다','떠나오다','떠들썩하다','떡국','떼','뚫다','뛰놀다','뛰어가다','뛰어나다','뛰어나오다',
    '뛰어내리다','뛰어넘다','뛰어놀다','뛰어오르다','뜨다','뜯다','뜰','뜻대로','뜻밖','뜻밖에','뜻하다','띄다','띄우다','라운드','라이벌','라인',
    '라켓','레이저','레저','로봇','로터리','리','리그','리터','마누라','마당','마당','마디','마땅하다','마라톤','마련','마련','마무리','마약',
    '마요네즈','마음가짐','마음껏','마음먹다','마음씨','마이크','마주치다','마찰','마크','막걸리','막상','만','만','만만하다','만세','만점',
    '만족','만족스럽다','만하다','만화가','말기','말다','말리다','말리다','말없이','말투','맘','맘대로','맛보다','망설이다','망원경','망치다',
    '망하다','맞이하다','맡다','매','매너','매달','매달다','매달리다','매번','매스컴','매장','매주','매체','맺다','머리말','머리칼','머물다',
    '먹고살다','먹다','먹이','멋지다','멍멍','멎다','메우다','면','면','면','면담','면적','면접','면하다','멸치','명단','명령어','명예',
    '명의','명칭','명확하다','모금','모범','모색하다','모여들다','모조리','모집','모집하다','모처럼','모퉁이','목록','목숨',
    '몰려들다','몰려오다','몸매','몸속','몸짓','몸통','못','못되다','못생기다','못지않다','묘사','묘사하다','무','무관심','무관심하다',
    '무궁화','무기','무너지다','무대','무덤','무덥다','무려','무료','무리','무리','무리하다','무사하다','무용가','무의미하다','무지개',
    '무책임하다','묵다','묵다','묶이다','문구','문득','문밖','문법','문서','문자','문제되다','문학적','문화재','문화적','묻다','묻히다',
    '묻히다','물가','물결','물기','물러나다','물리학','물질','물질적','물체','뭘','뭣','미끄러지다','미끄럽다','미니','미루다',
    '미만','미사일','미스','미역','미용실','미움','미처','미혼','민간','민속','민주','민주주의','민주화','믿어지다','밀리다','밀접하다',
    '밑바닥','바','바','바가지','바구니','바깥쪽','바람','바람직하다','바로잡다','바싹','바이러스','바치다','바퀴','바퀴','바탕','박다',
    '박히다','반기다','반대편','반말','반면','반발','반복되다','반성','반성하다','반영하다','반응','반죽','반짝거리다','반짝이다','발걸음',
    '발길','발끝','발달되다','발레','발바닥','발자국','발전','발전되다','발톱','발표되다','발휘하다','밝아지다','밝혀내다','밝혀지다',
    '밤새','밤새우다','밤색','밤하늘','밥상','방면','방바닥','방송사','방송하다','방식','방안','방울','방울','방지','방지하다','방해',
    '방해하다','배','배다','배우자','배추김치','배치','백두산','백색','백성','백인','백제','뱃사람','뱉다','버려지다','버티다','번개',
    '번거롭다','번역하다','번지','벌','벌','벌','벌금','벌떡','벌어지다','범위','범인','범죄','법률','법원','법적','법칙','베다','벤치',
    '벼','변경','변동','변명','변신','변화되다','별다르다','별도','별명','별일','병실','병아리','보고하다','보관','보내오다','보너스','보도',
    '보도되다','보도하다','보라색','보름','보리','보살피다','보상','보수','보수적','보안','보완하다','보자기','보장','보장되다',
    '보장하다','보전','보조','보존','보존하다','보충하다','보편적','보호되다','보호하다','복사기','복숭아','볶음','본','본격적',
    '본부','본사','본성','본인','본질','볼','볼링','봉사','봉사하다','부담','부담하다','부대','부딪히다','부러지다','부문',
    '부분적','부상','부서지다','부위','부인','부재','부정','부정적','부정하다','부지런히','부채','부친','부품','부피','부회장',
    '북부','분노','분량','분리','분리되다','분리하다','분명하다','분명해지다','분석','분야','분주하다','분포하다','분필','분홍색','불가피하다',
    '불과','불과하다','불구하다','불러일으키다','불리다','불리하다','불법','불법','불어오다','불완전하다','불이익','불편','불평','불평등하다',
    '불필요하다','불행','불확실하다','붐비다','붓다','붙들다','붙잡다','붙잡히다','브랜드','비극','비기다','비난','비다','비둘기','비로소',
    '비롯되다','비롯하다','비만','비명','비바람','비비다','비상','비우다','비웃다','비율','비중','비추다','비치다','비판','비판적','비하다','비행',
    '비행','비행장','빗방울','빗줄기','빚','빛깔','빛나다','빠뜨리다','빠져나가다','빠져나오다','빨다','빼놓다','빼앗기다','빼앗다','뺏다','뻔하다',
    '뻔하다','뽑히다','뿌리치다','사건','사과','사귀다','사기','사나이','사냥','사들이다','사례','사립','사망','사망하다','사무소',
    '사무직','사방','사상','사생활','사설','사소하다','사슴','사실상','사업가','사업자','사이사이','사정','사춘기','사투리','사표',
    '사회생활','사회자','사회주의','사회학','산길','산부인과','산업','살림','살아가다','살아나다','살아남다','살아오다','살인','살피다','삶',
    '삼가다','삼계탕','삼국','삼다','삼키다','상','상관','상관없다','상관없이','상금','상담','상당','상당수','상당하다','상당히',
    '상대성','상대적','상대편','상류','상반기','상상력','상식','상업','상인','상점','상징적','상징하다','상쾌하다','상태','상표','상황','새',
    '새기다','새다','새로이','새롭다','새우다','색다르다','색연필','생','생기','생명','생물','생방송','생산','생산되다','생산력','생산자',
    '생산하다','생활비','생활수준','생활용품','서구','서늘하다','서명','서명하다','서민','서부','서서히','서양인','서적','서클','서툴다',
    '석','석사','선거','선명하다','선언하다','선원','선장','선전','선정하다','선진','선진국','선호하다','설득하다','설립하다','설명되다',
    '설문','설사','설치','설치되다','설치하다','섭섭하다','성','성','성경','성공적','성당','성립되다','성립하다','성숙하다',
    '성실하다','성장','성장하다','성적','성질','세','세계관','세다','세대','세련되다','세미나','세상에','세월','세제','세종대왕','세트','섹시하다',
    '셈','소규모','소극적','소득','소망','소매','소박하다','소비','소비하다','소속','소수','소아과','소요되다','소용','소원','소위','소유','소유자',
    '소유하다','소음','소재','소중하다','소중히','소지품','소질','소프트웨어','소형','소홀히','소화','소화하다','속담','속마음','속삭이다',
    '속상하다','속이다','손길','손등','손수','손쉽다','손실','손잡다','손질','손질하다','손해','솜','솜씨','솟다','쇠','수고',
    '수단','수도','수도권','수도꼭지','수동적','수리하다','수만','수면','수명','수백','수석','수시로','수십','수업','수없이','수요','수입되다',
    '수입품','수저','수준','수집','수집하다','수천','수컷','수필','수행하다','수험생','숙녀','순간적','순수','순식간','순위','순진하다','순하다',
    '숨기다','숨지다','스승','스위치','스치다','스튜디오','슬그머니','슬쩍','습기','승객','승리','승리하다','승부','승진','시각','시각',
    '시금치','시기','시기','시나리오','시대적','시댁','시도','시들다','시디','시디롬','시멘트','시선','시스템','시야','시외버스','시위','시일',
    '시장','시점','시중','시즌','시집','시집가다','시청률','시합','식기','식량','식료품','식생활','식욕','식품점','식히다','신','신경','신고하다',
    '신규','신기하다','신기하다','신념','신라','신부','신분','신비','신설','신세','신세대','신속하다','신인','신제품','신중하다','신청서',
    '신청하다','신체적','신화','실','실감','실로','실리다','실망','실망하다','실습','실시','실시되다','실시하다','실은','실장','실정','실제',
    '실제로','실질적','실천','실천하다','실체','실컷','실태','실험','실현','실현되다','실현하다','심각해지다','심리적','심사','심심하다','심장',
    '심정','심판','싱싱하다','싶어지다','싸구려','싹','싼값','쌍','쌍둥이','썩','썰렁하다','쓰다듬다','쓰러지다','쓰이다','쓴맛','쓸다','쓸데없다',
    '쓸데없이','쓸쓸하다','씌우다','씨앗','씻기다','씻기다','아깝다','아끼다','아냐','아니하다','아드님','아랫사람','아르바이트','아무개','아무런',
    '아쉬움','아쉽다','아스팔트','아예','아울러','아유','아이디어','아하','악몽','안','안개','안과','안기다','안기다','안내','안동','안부',
    '안심하다','안정','안정되다','안팎','앉히다','알루미늄','알아내다','알아보다','알아주다','알코올','암시','암컷','압력','앞날','앞두다','앞문',
    '앞바다','앞서','앞세우다','앞장서다','애','애쓰다','애정','애초','액수','앨범','야간','야구장','야단','야옹','야하다','약','약수','약점',
    '약품','약해지다','약혼녀','약혼자','얄밉다','양','양국','양력','양보','양상추','양식','양식','양심','양옆','양주','얘','어기다',
    '어느덧','어려워지다','어리석다','어저께','어지럽다','어째서','어쨌든','어쩌다','어쩌다가','어쩜','어찌','어찌나','어찌하다','억울하다','언덕',
    '언론','언어','얻어먹다','얼리다','얼마간','얼핏','엄격하다','엄숙하다','엄청나다','업다','업종','업체','엇갈리다','엉덩이','엉망','엉터리',
    '엎드리다','에','엔진','여가','여간','여건','여겨지다','여군','여기다','여럿','여론','여왕','여인','여전하다','여전히','역','역사상','역사학',
    '연간','연결','연관','연구실','연구원','연극','연기','연기되다','연기자','연기하다','연두색','연락','연령','연상하다','연설','연속','연애',
    '연예인','연인','연장','연주','연출','연출하다','연합','열기','열매','열정','열중하다','엷다','염려','엿보다','영','영남','영상','영양','영업',
    '영역','영웅','영향','영향력','영혼','영화관','영화배우','영화제','옆구리','예','예감','예고하다','예방','예방하다','예보','예비','예산',
    '예상되다','예상하다','예선','예술적','예습','예습하다','예식장','예약하다','예외','예의','예정되다','예측하다','예컨대','오락','오로지',
    '오르내리다','오염','오염되다','오페라','오해','오히려','옥상','온갖','온돌','온라인','온종일','올','올','올가을','올라서다','올라타다','올려다보다',
    '올리다','올바르다','올여름','옷차림','와이셔츠','완성','완성되다','완성하다','완전','완전하다','왕비','왕자','외갓집','외과','외다','외로움',
    '외면하다','외모','외부','외아들','외제','외치다','외침','외할아버지','요','요구','요구되다','요리사','요약하다','요청하다','욕','욕하다','용',
    '용감하다','용기','용기','용도','용서','용서하다','용어','우려','우습다','우아하다','우정','우주','우편','운명','운반','운영하다','운전사',
    '운행','울리다','울음소리','움직임','웃음소리','워낙','원','원고','원서','원인','원장','월세','웬','웬만하다','위','위기','위대하다',
    '위로','위로하다','위반하다','위법','위성','위원','위원장','위주','위험성','위협','윗몸','윗사람','유능하다','유리하다','유머','유물',
    '유발하다','유사하다','유산','유의하다','유적','유적지','유지되다','유지하다','유형','육군','육상','육체','육체적','으레','은','은은하다',
    '은행나무','음력','음반','음성','음식물','음식점','음주','응답하다','의논','의논하다','의도','의도적','의류','의무','의문','의복','의사','의식',
    '의식','의식하다','의심','의외로','의욕','의원','의존하다','의지','의지하다','의학','이','이같이','이끌다','이내','이내','이념','이놈','이다음',
    '이달','이대로','이데올로기','이동하다','이따금','이래','이래서','이러다','이런저런','이력서','이론적','이롭다','이룩하다','이르다','이리저리','이민',
    '이별','이사장','이상적','이슬','이어','이어서','이어지다','이용자','이윽고','이자','이제야','이중','이해','이해관계','이해되다','익다',
    '익히다','익히다','인','인간관계','인간성','인간적','인격','인공','인근','인도','인류','인물','인사','인상','인상적','인쇄','인식하다','인연',
    '인재','인정되다','인정받다','인정하다','인제','인종','인체','인하','인하다','일단','일대','일반인','일부러','일상적','일생','일손','일시적',
    '일식','일쑤','일어서다','일일이','일자','일자리','일정하다','일종','일찍이','일체','일치','일치하다','일행','임금','임무','임신부','임신하다',
    '입국','입대','입력','입력하다','입맛','입사','입사하다','입시','입장','입히다','잇다','잇따르다','잊혀지다','자','자격증',
    '자극','자극하다','자네','자녀','자랑','자리','자매','자부심','자살','자살하다','자세','자세하다','자신감','자연적','자연현상','자연환경','자연히',
    '자원','자율','자정','자존심','자취','자판','작성','작성하다','작업','작용','작용하다','작은딸','작은아들','작은아버지','작은어머니','작품',
    '잔디','잔디밭','잘나다','잘리다','잠그다','잠기다','잠바','잠수함','잠자리','잠자리','잡수다','잡아당기다','잡아먹다','장관','장기간','장기적',
    '장난','장례','장례식','장르','장면','장모','장모님','장비','장사꾼','장수','장식','장애인','장인','장차','잦다','재능','재다','재밌다',
    '재빨리','재생','재수','재우다','재정','재주','재즈','재판','재학','재활용','재활용품','저고리','저기','저러다','저마다','저울','저절로',
    '저지르다','저편','적성','적용','적용되다','적응','적응하다','적절하다','적합하다','적히다','전','전개','전개되다','전개하다','전공하다',
    '전국적','전기','전달','전달되다','전망','전망하다','전문적','전문점','전문직','전반','전반적','전설','전세','전시','전시되다','전시장','전시하다',
    '전시회','전용','전주','전통문화','전환','전환하다','전후','절','절대','절대적','절망','절약','절차','젊음','점검','점잖다','접근','접근하다','접다',
    '접촉','접하다','정기','정기적','정당','정리되다','정면','정반대','정보화','정부','정비','정상','정상적','정신과','정신없이','정오',
    '정장','정지','정직하다','정치권','정치인','정치학','젖','제거하다','제공','제과점','제대하다','제도적','제비','제사','제삿날','제시','제시되다',
    '제시하다','제안','제안하다','제약','제외되다','제외하다','제의','제의하다','제자','제자리','제작','제작하다','제출','제한되다','제한하다','조각',
    '조개','조그마하다','조기','조깅','조르다','조명','조미료','조선','조절','조절하다','조정','조정하다','조직','조화되다','존경하다','존재',
    '존재하다','존중하다','졸리다','졸음','좁히다','종교적','종소리','종종','종합하다','좋아','좌우','죄','죄인','주','주거','주고받다',
    '주관적','주년','주름','주름살','주문','주문','주민','주방','주식','주어지다','주요하다','주의','주의하다','주일','주장','주저앉다','주전자',
    '주한','죽','줄거리','줄곧','줄어들다','중계방송','중년','중단','중단되다','중단하다','중대하다','중독','중반','중부','중세','중소기업','중순',
    '중심지','중앙','중얼거리다','중요시하다','즉석','증가','증가하다','증거','증권','증권사','증명하다','지각','지겹다','지경','지극히','지금껏','지급',
    '지급하다','지나치다','지난날','지능','지니다','지다','지대','지도','지도자','지도하다','지루하다','지름길','지리산','지방','지배하다','지불하다',
    '지속되다','지속적','지시','지시하다','지식','지식인','지우다','지워지다','지원','지원하다','지위','지저분하다','지적','지적','지적되다','지적하다',
    '지점','지지','지진','지출','지켜보다','지폐','지혜','직선','직장인','직전','직접적','직후','진급','진단','진단하다','진동','진로','진료','진리',
    '진실','진실로','진실하다','진심','진지하다','진찰','진출하다','진통','진행','진행자','질병','질적','짐작','짐작하다','집단','집단적','집안일',
    '집어넣다','집중되다','집중적','집중하다','짚다','짜다','짜다','짜증스럽다','짝','쩔쩔매다','쪽','쫓겨나다','쫓기다','쫓다','쭉','찌꺼기','찌다',
    '찍히다','찢다','찢어지다','차','차','차다','차다','차라리','차량','차림','차마','차별','차선','차이점','차차','차창','차츰','착각','착각하다',
    '찬성','찬성하다','참','참가','참고하다','참되다','참새','참석','참석자','참여','참여하다','참외','참으로','참조','창','창가','창구','창작',
    '창조','창조적','창조하다','창피하다','찾아다니다','채점','책임감','책임지다','처녀','처리','처벌','처지','척','척','척하다',
    '천','천국','천둥','천장','천재','철','철','철도','철저하다','철저히','철학','철학자','철학적','청춘','청하다','체계적','체력','체온',
    '체육관','체조','체하다','체험','체험하다','초기','초대','초등학생','초반','초상화','초순','초여름','초원','초저녁','초점','초조하다','초청',
    '초청하다','촌스럽다','촛불','총','총','총각','총리','최고급','최대한','최상','최소','최신','최악','최저','최종','최후','추가','추가되다',
    '추가하다','추석','추진','추진하다','추천','추천하다','추측','축구장','축소','출국','출발점','출산','출석하다','출신','출연','출입국','출퇴근',
    '출판','출판사','출현하다','충격적','충고','충돌','충돌하다','취업','취재','취향','치다','치료법','치르다','치아','치우다',
    '친정','친해지다','칠하다','침','침묵','침착하다','칭찬하다','칸','칼국수','캄캄하다','캐릭터','캠페인','컨디션','컬러','케첩','코끝','코드',
    '코미디','코스','코스모스','코치','코트','쾌감','쿠데타','크림','큰딸','큰아들','큰아버지','큰어머니','큰절','클래식','클럽','키스','타고나다',
    '타다','타다','타다','타락','타오르다','타입','타자기','탁','탁구','탁월하다','탁자','탄생','탄생하다','탈출하다','탓','태아','택하다','터',
    '터지다','턱','텅','테러','텍스트','토대','토론자','토론하다','토론회','토하다','통계','통과','통과하다','통로','통역','통일하다','통제',
    '통증','통합','통화','통화','퇴원','퇴원하다','퇴직금','투명하다','투자','투표','튀기다','튀김','튀다','튀어나오다','트럭','트이다','특급',
    '특성','특수','특수성','특이하다','특정하다','튼튼히','틀','틀림없이','틈','파괴하다','파다','파악하다','파출소','판',
    '판결','판단하다','판매되다','판사','팝송','팩스','팩시밀리','퍼지다','퍽','페인트','펴내다','편','편','편견','편의','편의점','평','평가','평가되다',
    '평가하다','평균','평상시','평양','평화롭다','폐지','포근하다','포인트','포장마차','포크','포함','폭넓다','폭력','표','표면','표시','표시',
    '표시하다','표준','표현되다','푸다','풀어지다','품','품다','품목','품질','풍부하다','풍속','풍습','프린터','피곤','피디','피망','피하다',
    '피해','피해자','필수','필수적','필연적','필요성','필자','핑계','하','하긴','하나님','하나하나','하나하나','하느님','하도','하드웨어',
    '하룻밤','하반기','하순','하천','하필','학과','학교생활','학급','학력','학번','학부모','학비','학술','학용품','학위','학자','학점',
    '한','한가운데','한가하다','한겨울','한결','한계','한구석','한글날','한낮','한눈','한데','한때','한마디','한문','한반도','한밤중',
    '한순간','한식','한여름','한정되다','한정하다','한창','한층','한평생','한하다','함께하다','합격하다','합리적','합하다','항공','항공기',
    '항구','항의','해결되다','해군','해내다','해답','해당','해당되다','해당하다','해롭다','해물','해석','해석하다','해설','해소',
    '해소하다','해수욕장','해안','핵','핵심','핸드백','햄','행사','행운','행위','행하다','행해지다','향','향상','향상되다','허가','허락',
    '허락하다','허용','허용되다','허허','헤매다','헤아리다','헬기','현','현관문','현대인','현대적','현상','현실','현실적','현장','혈액',
    '협력','형','형사','형성','형성되다','형성하다','형수','형식','형식적','형태','형편','혜택','호기심','호남','호박','호실','호주머니',
    '호흡','혹시','혼나다','혼잣말','홀로','홍보','홍수','화면','화살','화장','화장지','화재','화제','화학','확','확립하다','확보',
    '확산되다','확신','확신하다','확인되다','확장','확정','환경오염','환영하다','환율','환하다','활기','활발해지다','활발히','활용',
    '활짝','회','회견','회관','회복','회복되다','회의','회전','횟수','효과적','효도','효도하다','효율적','효자','후기','후반','후보',
    '후회','훈련','훔치다','휴식','흉내','흐려지다','흐름','흐리다','흑백','흑인','흔들리다','흔적','흔하다','흘러내리다','흥미롭다',
    '흥분','흥분하다','흩어지다','희곡','희망하다','희생','희생하다','힘겹다','힘껏','힘들어하다','힘쓰다','힘없이','힘차다'
);

var wordArr2 = new Array( // 단어 리스트
    '가격','가구','가까워지다','가까이','가까이','가꾸다','가난하다','가늘다','가능성','가능하다','가득','가득하다','가로','가루','가리다',
    '가리다','가리키다','가만히','가스','가슴속','가요','가위','가이드','가정','가져가다','가져다주다','가죽','가지','가지','가짜','각',
    '각각','각각','각국','각자','각자','각종','간단하다','간단히','간식','간장','갈다','갈다','갈비탕','갈색','갈아입다','갈아타다',
    '감','감다','감동','감상','감상하다','감자','감정','강당','강도','강물','강아지','강원도','강제','강조하다','강하다','갖다','갖다','개구리',
    '개나리','개발하다','개인','개인적','걔','거리','거실','거의','거짓','거짓말','걱정되다','걱정스럽다','건너가다','건너다','건너오다','건너편',
    '건지다','건축','걸리다','걸음','검다','검사','검정색','겁','겉','게다가','겨우','겨울철','견디다','결과','결국','결심하다','결정','결정되다',
    '결정하다','경기','경기도','경기장','경상도','경영','경우','경제','경제적','경험','경험하다','곁','계단','계산','계산기','계산하다','계속되다',
    '계속하다','계약','계획하다','고개','고객','고교','고구마','고급','고려하다','고르다','고르다','고모','고모부','고민','고민하다','고생','고생하다',
    '고속','고속도로','고속버스','고장','고장','고추','고추장','고춧가루','고치다','고통','곧바로','골목','골목길','골프','골프장','곰','곱다','곳곳',
    '공간','공기','공동','공무원','공사','공연','공장','공짜','공항버스','과거','과목','과장','과제','과학','과학자','과학적','관객','관계','관광',
    '관광객','관광지','관련','관련되다','관련하다','관리','관심','관찰하다','관하다','광고','광주','괜히','괴롭다','굉장히','교류','교문','교육',
    '교통사고','교포','교환','구경하다','구멍','구체적','구하다','구하다','국','국가','국기','국내','국립','국물','국민','국수','국어','국제',
    '국회의원','군','군','군대','군데','굳이','굵다','굽다','궁금하다','권투','권하다','귀국','귀국하다','귀엽다','규칙','규칙적','그냥','그늘',
    '그다음','그다지','그대로','그래도','그램','그러므로','그러하다','그런','그렇게','그렇지','그려지다','그룹','그리','그림자','그립다','그만',
    '그만두다','그만큼','그만하다','그중','그치다','그해','근데','근로자','근무','근무하다','글','글쎄','글쎄요','글쓰기','글씨','글자','금',
    '금년','금방','금연','금지','금지하다','급하다','긍정적','기간','기계','기대','기대하다','기도','기록하다','기르다','기름','기본','기뻐하다',
    '기쁘다','기쁨','기사','기술','기억','기억나다','기억하다','기온','기운','기자','기준','기초','기침','기타','기회','긴장','긴장하다',
    '길가','길거리','길이','김','김치찌개','김포공항','깊다','깊이','깊이','까닭','까만색','까맣다','깜빡','깜짝','깨끗이','깨다','깨다','깨지다',
    '꺼내다','꺼지다','껌','껍질','꼭대기','꽃잎','꽤','꾸다','꾸미다','꾸준히','꿀','꿈꾸다','꿈속','끄덕이다','끊다','끊어지다','끌다','끓다',
    '끓이다','끝내','끼다','끼다','나누다','나다','나머지','나물','나뭇가지','나뭇잎','나비','나빠지다','나서다','나타나다','나타내다','나흘','낙엽',
    '낚시','날개','날아가다','날아오다','낡다','남','남','남기다','남다','남매','남산','남성','낫다','낫다','낯설다','낳다','내내','내놓다','내려놓다',
    '내려다보다','내밀다','내용','내지','냄비','냄새','너머','너무나','너희','넓어지다','넓히다','넘다','넘어가다','넘어서다','넘어지다','넘치다',
    '네거리','녀석','년대','년도','노동자','노랗다','노래방','노랫소리','노력','노력하다','노인','녹색','녹음','녹음하다','녹차','논문','논의하다',
    '놀랍다','놀이','놀이터','농구','농담','농사','농업','농촌','높아지다','높이','높이','높이다','놓이다','놓치다','누르다','눈빛','눈썹','눈앞',
    '눕다','뉴욕','느껴지다','느끼다','느낌','느리다','늘','늘다','늘리다','늘어나다','늙다','능력','다가가다','다가오다','다녀가다','다수','다양하다',
    '다이어트','다치다','다하다','다행히','단','단맛','단순하다','단순히','단점','단지','단지','단체','닫히다','달걀','달다','달다','달라지다',
    '달려가다','달려오다','달리다','달리다','달빛','달아나다','닮다','담그다','담기다','담다','담당하다','담요','담임','답답하다','답장','답하다',
    '닷새','당근','당기다','당신','당연하다','당연히','당장','당황하다','닿다','대','대','대구','대기업','대단하다','대단히','대도시','대문',
    '대부분','대신','대전','대중','대중교통','대중문화','대통령','대표','대표적','대하다','대학교수','대학원','대한민국','대화하다','대회',
    '더구나','더럽다','더위','더하다','덕분','덕수궁','던지다','덜','덮다','데','데려가다','데려오다','데리다','도둑','도로','도로',
    '도망가다','도시락','도움','도자기','도중','도쿄(동경)','독서','독일어','돌','돌다','돌려주다','돌리다','돌보다','돌아보다','돌아서다',
    '동기','동네','동대문','동대문시장','동물원','동시','동아리','동양','동전','동창','동화','되게','된장','된장찌개','두껍다','두다','두다',
    '두드리다','두부','두세','두통','둘러보다','둥글다','뒤집다','뒤쪽','뒷산','드라마','들','들다','들려오다','들려주다','들르다','들리다',
    '들어서다','들여다보다','듯이','등','등','등','등록','등록금','등산로','디자이너','디자인','따다','따라가다','따라오다','따로','따르다',
    '따르다','딱','딴','땀','땅','땅콩','때때로','땜','떠들다','떠오르다','떠올리다','떡볶이','떨다','떨리다','떨어뜨리다','떨어지다','떼다',
    '또는','또다시','또한','똑같이','똑똑하다','뚜껑','뚱뚱하다','뛰어나가다','뛰어다니다','뛰어들다','뛰어오다','뜨다','뜨다','뜻','라이터',
    '런던','레몬','레스토랑','렌즈','리듬','마구','마늘','마련되다','마련하다','마루','마르다','마사지','마을','마음대로','마음속','마주',
    '마중','마찬가지','마치','마치다','마침','마침내','막','막','막내','막다','막히다','만','만남','만두','만들어지다','만약','만일','만족하다',
    '만족하다','만지다','만큼','만화','많아지다','말','말','말씀드리다','맞다','맞다','맞다','맞서다','맞은편','맞추다','맡기다','맡다','매년',
    '매다','매력','맨','머리카락','머릿속','머무르다','먹이다','먹히다','먼지','멀리','멀어지다','멈추다','멋','멋있다','메다','메모','메시지',
    '메일','며느리','명령','명절','명함','몇몇','몇십','모기','모니터','모델','모래','모레','모습','모시다','모양','모양','모으다','모이다',
    '모임','모자라다','목걸이','목사','목소리','목욕탕','목적','목표','몰다','몰래','몸무게','몸살','몹시','무','무게','무늬','무더위','무렵',
    '무릎','무섭다','무시하다','무어','무역','무용','무조건','무척','묶다','문장','문제점','문학','문화','묻다','물고기','물다','물론','물속',
    '물음','미디어','미래','미리','미소','미술','미술관','미워하다','미인','미치다','미치다','미팅','민족','믿다','믿음','밀가루','밀다',
    '밀리미터','밉다','및','바깥','바뀌다','바늘','바닥','바닷가','바닷물','바라다','바라보다','바르다','바르다','바보','바위','바이올린',
    '박사','박수','박스','반대','반대하다','반드시','반복하다','반장','반지','반찬','반하다','받아들이다','받침','발가락','발견','발견되다',
    '발견하다','발달','발달하다','발등','발목','발생','발생하다','발음하다','발전','발전하다','발표','발표하다','밝다','밝히다','밟다','밤',
    '밤낮','밤늦다','밤새다','밤중','밥그릇','밥맛','밥솥','방금','방문','방문','방문하다','방법','방송','방송국','방향','밭','배경','배구',
    '배꼽','배달','배드민턴','배우','배추','뱀','버릇','버리다','버섯','버터','버튼','번역','번째','벌다','벌레','벌리다','벌어지다','벌이다',
    '법','법','벗기다','베개','베이징(북경)','벨트','벽','변하다','변호사','변화','변화하다','별','별로','병들다','보고','보고서','보관하다',
    '보람','보이다','보이다','보통','보험','보호','복도','복사','복사하다','복습','복습하다','볶다','볶음밥','본래','볼일','봉지','봉투','뵈다',
    '뵈다','뵙다','부','부근','부끄러움','부끄럽다','부동산','부드럽다','부딪치다','부러워하다','부럽다','부르다','부분','부자','부작용','부잣집',
    '부장','부족','부족','부족하다','부지런하다','부처','부치다','부탁','부탁하다','북','북한','분명','분명히','분석하다','분위기','불가능하다',
    '불교','불꽃','불리다','불만','불빛','불쌍하다','불안','불안하다','불편하다','불행하다','붉다','붓다','붙다','붙이다','블라우스','비교',
    '비교적','비교하다','비닐','비닐봉지','비밀','비서','비용','비키다','비타민','비판하다','빌다','빌딩','빌리다','빗','빗물','빛','빠지다',
    '빠지다','빨갛다','빨다','빨래','빼다','뺨','뻗다','뼈','뽑다','뿌리','뿌리다','뿐','사계절','사고','사과하다','사라지다','사랑스럽다',
    '사모님','사무','사물','사실','사실','사업','사용','사용되다','사용자','사원','사위','사이좋다','사자','사진기','사촌','사회','사회적',
    '사흘','산소','산속','살','살리다','살짝','살펴보다','삶다','삼촌','상대','상대방','상상','상상하다','상자','상처','상추','상품',
    '상하다','새끼','새로','새벽','새소리','새우','새해','생각나다','생각되다','생겨나다','생신','생활하다','생활환경','서너','서두르다','서랍',
    '서로','서류','서비스','서양','서투르다','석유','섞다','섞이다','선배','선수','선택','선택하다','선풍기','설거지','설날','설렁탕','섬','섭씨',
    '성','성격','성공','성공하다','성별','성인','성적','성함','세계','세계적','세금','세기','세다','세로','세상','세우다','세워지다','세탁',
    '세탁소','센터','소','소개','소개되다','소나기','소나무','소녀','소년','소리','소리치다','소문','소문나다','소비자','소설','소설가','소스',
    '소시지','소식','소용없다','소주','소포','속도','속옷','속하다','손녀','손목','손바닥','손발','손뼉','손수건','손자','손잡이','손톱','솔직하다',
    '솔직히','송아지','송이','송편','쇼','수고하다','수년','수돗물','수많다','수상','수술','수염','수입','수입','수입하다','수출','수출하다','수표',
    '수학','수학','수화기','숙소','숙이다','순간','순서','순수하다','술병','술자리','술잔','술집','숨','숨다','숫자','숲','쉬다','스님','스스로',
    '스스로','스웨터','스케이트','스케줄','스키장','스타','스타일','슬퍼하다','슬픔','습관','승용차','시골','시끄럽다','시내','시내버스','시대',
    '시도하다','시리즈','시민','시부모','시설','시아버지','시어머니','시외','시인','시절','시집','시청','시청자','시키다','식','식구','식다',
    '식물','식빵','식용유','식초','식품','신','신고','신랑','신문사','신문지','신부','신선하다','신용','신입생','신청','신체','신호','신호등',
    '신혼부부','신혼여행','싣다','실내','실력','실수','실수하다','실제','실패','실패하다','싫어지다','심각하다','심다','심리','심부름','심하다',
    '심해지다','싱겁다','싸다','싸움','쌀','쌓다','쌓이다','썩다','썰다','쏘다','쏟다','쏟아지다','쓰다','쓰레기통','쓰이다','씨','씨름',
    '씩씩하다','씹다','아가씨','아까','아까','아나운서','아뇨','아니','아니야','아래쪽','아래층','아마도','아무것','아무래도','아무렇다',
    '아무리','아무튼','아버님','아시아','아아','아이','아이고','아프리카','아픔','악기','악수','안내하다','안되다','안방','안전','안전하다',
    '안주','안쪽','안타깝다','알','알려지다','알리다','알맞다','알아듣다','앓다','암','앞길','앞뒤','앞서다','앞쪽','애','애인','액세서리',
    '야','야외','야채','약','약간','약간','약하다','얇다','양','양념','양배추','양보하다','양쪽','양파','얕다','얘','어느새','어두워지다',
    '어둠','어둡다','어때','어떡하다','어려움','어리다','어리다','어린아이','어린애','어린이날','어머','어머님','어색하다','어울리다','어젯밤',
    '어쩌다','어쩌면','어쩐지','억','언젠가','얹다','얻다','얼다','얼른','얼음','업무','없애다','없어지다','없이','엉뚱하다','엊그제','에너지',
    '엔','엘리베이터','여','여고생','여관','여기저기','여대생','여름철','여보','여성','여우','여유','여직원','여쭈다','여행사','역사가','역사적',
    '역시','역할','연결되다','연결하다','연구','연구소','연구자','연구하다','연기','연기','연락처','연락하다','연말','연세','연하다','연휴',
    '열','열리다','열리다','열차','열흘','염려하다','엽서','영상','영원하다','영원히','영하','옆방','옆집','예','예금','예매하다','예상','예술',
    '예술가','예약','예전','예절','예정','옛','옛날이야기','오','오가다','오늘날','오래도록','오래되다','오래전','오랜','오랫동안','오른발','오른손',
    '오리','오븐','오이','오직','오징어','오피스텔','옥수수','온','온도','온몸','온통','올라오다','올려놓다','올림픽','옮기다','옳다','와','와인',
    '완벽하다','완전히','왕','왠지','외','외교','외교관','외롭다','외삼촌','외우다','외출','외출하다','외할머니','왼발','왼손','요구하다','요금',
    '요새','요청','욕실','욕심','용돈','우리말','우선','우수하다','우승','우승하다','우연히','우울하다','우표','운','운동복','운전기사','운전자',
    '울리다','울산','울음','움직이다','웃기다','웃어른','웃음','원래','원숭이','원피스','원하다','월급','월드컵','웨이터','웬일','위반','위아래',
    '위쪽','위층','위치','위치하다','위하다','유교','유난히','유럽','유리','유리창','유명','유치원','유학','유학','유학생','유행','유행하다',
    '으응','음','음료','음료수','음악가','응','의견','의미','의미하다','의심하다','의하다','이것저것','이곳저곳','이기다','이날','이동','이따가',
    '이러하다','이렇게','이루다','이루어지다','이뤄지다','이르다','이르다','이리','이마','이모','이미','이미지','이발소','이불','이빨','이사',
    '이사하다','이상','이상','이상','이상하다','이성','이외','이용','이용되다','이용하다','이웃','이웃집','이유','이익','이전','이튿날','이틀',
    '이하','이해','이혼','이혼하다','이후','익다','익숙하다','익숙해지다','인간','인구','인기','인분','인사말','인삼','인삼차','인상','인상',
    '인생','인원','인제','인천공항','인터넷','인터뷰','인형','일기','일기','일등','일반','일반적','일부','일상','일상생활','일으키다','일정',
    '일회용','일회용품','읽히다','임금','임시','임신','입구','입술','입원','입원하다','입학','입학하다','자','자가용','자격','자기','자기','자꾸',
    '자꾸만','자동','자라나다','자라다','자랑스럽다','자랑하다','자료','자르다','자세히','자식','자신','자신','자연','자연스럽다','자유','자유롭다',
    '자체','자판기','작가','작아지다','잔뜩','잔치','잘되다','잘못','잘못','잘못되다','잘못하다','잘살다','잘생기다','잠들다','잠시','잠옷',
    '잡히다','장가','장갑','장군','장난감','장남','장래','장마','장사','장점','장학금','재료','재산','재작년','재채기','쟤','저',
    '저녁때','저런','저런','저렇게','저렇다','저리','저번','저자','저축','저희','적','적','적극','적극적','적당하다','적당히','적어도','적어지다',
    '적용하다','전공','전국','전기','전기밥솥','전날','전달하다','전라도','전문','전문가','전부','전부','전자','전쟁','전철','전체','전체적',
    '전통','전통적','전하다','전해지다','전혀','전화기','절','절','절대','절대로','절반','절약하다','젊다','젊은이','점','점','점수',
    '점심때','점원','점점','점차','접시','젓다','정','정거장','정답','정도','정리','정리하다','정말','정말','정말로','정문','정보','정상','정식',
    '정신','정신적','정원','정치','정치적','정하다','정해지다','정확하다','정확히','젖다','제공하다','제대로','제목','제발','제법','제출하다','제품',
    '제한','조각','조건','조그맣다','조금씩','조사','조사하다','조상','조심스럽다','조심하다','조용히','조카','존댓말','졸다','졸업생','좁다','종',
    '종교','종로','종류','종업원','종이컵','종일','종합','좋아지다','좌석','주로','주머니','주먹','주무시다','주문하다','주변','주부','주사','주요',
    '주위','주인공','주장하다','주제','주차','주차장','주차하다','주택','죽','죽다','죽음','죽이다','준비되다','준비물','줄','줄','줄기','줄다',
    '줄무늬','줄이다','줍다','중','중간','중국집','중심','중요','중요성','쥐','쥐다','즉','즉시','즐거움','즐거워하다','즐기다','증상','증세','지',
    '지구','지구','지나가다','지나다','지나치다','지난번','지난해','지다','지다','지다','지르다','지방','지붕','지역','지점','지치다','지키다',
    '지하도','직업','직원','직장','직접','직접','진달래','진짜','진짜','진출','진하다','진행되다','진행하다','질','질서','짐','집다','집안',
    '집중','짓','짓다','짙다','짜증','짧아지다','쪽','찌다','찌르다','차갑다','차남','차다','차다','차례','차리다','차이','착하다','찬물','참',
    '참가하다','참기름','참다','참석하다','찻잔','창고','창밖','찾아가다','찾아내다','찾아보다','찾아오다','채널','채소','채우다','책가방','책방',
    '책임','책임자','챔피언','챙기다','철','첫','첫날','청년','청소기','청소년','체육','체중','쳐다보다','초','초','초록색','초밥','초보',
    '초보자','초청장','총장','촬영','최고','최근','최대','최선','최소한','최초','추억','추위','축구공','축제','축하','출구','출근','출근하다',
    '출발','출연하다','출입','출입문','출장','충격','충분하다','충분히','충청도','취소','취소하다','취직','취하다','취하다','치과','치료','치료하다',
    '치우다','치즈','친절','친척','친하다','침실','칭찬','카레','카운터','카페','캠퍼스','커다랗다','커지다','커튼','켜지다','코끼리','코너','코피',
    '콘서트','콤플렉스','콩','콩나물','크기','큰길','큰소리','큰일','키우다','킬로','킬로그램','킬로미터','탑','태도','태양','태우다','태우다','태풍',
    '탤런트','터','터널','터뜨리다','터미널','턱','털','털다','테스트','테이프','토끼','토론','토마토','톤','통','통','통신','통일','통장','통하다',
    '퇴근','퇴근하다','특별','특별하다','특별히','특징','특히','튼튼하다','틀다','틀리다','틀림없다','티셔츠','파','파도','파랗다','파리','파리',
    '파일','판단','판매','판매하다','팔리다','패션','팩','팬','팬','팬티','펴다','편','편리하다','편안하다','편하다','편히','펼쳐지다','평범하다',
    '평생','평소','평일','평화','포기하다','포도주','포스터','포장','포함되다','포함하다','폭','표시하다','표정','표현','표현하다','푸르다','푹',
    '풀','풀','풀다','풀리다','풍경','프로','프로','프로그램','플라스틱','피','피다','피로','피로하다','피부','피시','필름','필통','하루','하숙집',
    '하얀색','하얗다','하여튼','하품','하하','학기','학생증','학습','학원','한국적','한꺼번에','한동안','한두','한둘','한라산','한숨','한잔','한잔하다',
    '한쪽','한참','한편','한편','할인','함부로','합격','합치다','해결','해결하다','해마다','해석','해외','해외여행','햇볕','햇빛','햇살','행동',
    '행동하다','행복','행복하다','행사','향기','향수','향하다','허용하다','헌','헤어지다','혀','현관','현금','현대','현재','현재','현지','형님',
    '형부','형제','호랑이','호선','호수','혹은','홈페이지','홍차','화가','화나다','화려하다','화분','화장품','확대되다','확대하다','확실하다',
    '확실히','확인','확인하다','환갑','환경','환영','활동','활동하다','활발하다','활용하다','회복하다','회색','회원','회장','회화','횡단보도','효과',
    '후배','후춧가루','후회하다','훌륭하다','훨씬','휴가','흐르다','흐리다','흔들다','흔히','흘러가다','흘러나오다','흘리다','흙','흥미','희다','희망'
);
var wordArr3 = new Array( // 단어 리스트
    '가게','가깝다','가끔','가다','가다','가르치다','가방','가볍다','가수','가슴','가운데','가을','가장','가져오다','가족','가지다','가지다',
    '간호사','갈비','감기','감사','감사하다','감사하다','갑자기','값','강','같다','같이','개','개','개월','거','거','거기','거리','거울',
    '걱정','걱정하다','건강','건강하다','건물','걷다','걸다','걸어가다','걸어오다','검은색','것','게임','겨울','결혼','결혼식','결혼하다','경복궁',
    '경주','경찰','경찰관','경찰서','경치','계란','계속','계시다','계시다','계절','계획','고기','고등학교','고등학생','고맙다','고양이','고프다',
    '고향','곧','곳','공','공부','공부하다','공원','공중전화','공책','공항','공휴일','과','과일','과자','괜찮다','교과서','교수','교실',
    '교통','교회','구','구경','구두','구름','구십','구월','군인','권','귀','그','그','그','그거','그것','그곳','그날','그동안','그때','그래',
    '그래','그래서','그래서','그러나','그러니까','그러면','그런데','그럼','그럼','그렇다','그렇지만','그릇','그리고','그리다','그림','그분',
    '그쪽','극장','근처','금요일','급','기다리다','기분','기숙사','기차','길','길다','김밥','김치','깎다','깨끗하다','꼭','꽃','꿈','끄다',
    '끝','끝나다','끝내다','나','나가다','나가다','나다','나라','나무','나쁘다','나오다','나이','나중','날','날다','날씨','날짜','남녀','남대문',
    '남대문시장','남동생','남자','남쪽','남편','남학생','낮','낮다','내년','내다','내다','내려가다','내려오다','내리다','내일','내일','냉면',
    '냉장고','너','너무','넓다','넣다','네','네','넥타이','넷','넷째','넷째','년','노란색','노래','노래하다','노트','놀다','놀라다','높다','놓다',
    '놓다','누구','누나','눈','눈','눈물','뉴스','늦다','늦다','다','다','다녀오다','다니다','다르다','다른','다리','다리','다섯','다섯째',
    '다섯째','다시','다음','닦다','단어','닫다','달','달','달다','달러','달러','달력','닭','닭고기','담배','대답','대답하다','대사관','대학',
    '대학교','대학생','대화','댁','더','덥다','도서관','도시','도와주다','도착','도착하다','독일','돈','돌아가다','돌아오다','돕다','동물',
    '동생','동안','동쪽','돼지','돼지고기','되다','두','둘','둘째','둘째','뒤','드리다','드리다','듣다','들다','들다','들어가다','들어오다',
    '등산','따뜻하다','딸','딸기','때','때문','떠나다','떡','또','똑같다','똑바로','뛰다','뛰다','뜨겁다','라디오','라면','러시아','마리',
    '마시다','마음','마지막','마흔','만','만','만나다','만들다','많다','많이','말','말다','말다','말씀','말씀하다','말하다','맑다','맛',
    '맛없다','맛있다','매우','매일','매일','맥주','맵다','머리','먹다','먹다','먼저','멀다','메뉴','며칠','명','몇','몇','모두','모두',
    '모든','모르다','모자','목','목요일','목욕','몸','못','못하다','못하다','못하다','무겁다','무슨','무엇','문','문제','묻다','물','물건',
    '물론','물어보다','뭐','뭐','미국','미안하다','미터','밑','바꾸다','바나나','바다','바람','바람','바로','바쁘다','바지','박물관','밖',
    '반','반','반갑다','받다','발','발음','밝다','밤','밥','방','방학','배','배','배','배고프다','배부르다','배우다','백','백','백화점','버리다',
    '버스','번','번호','벌써','벗다','별','병','병','병원','보내다','보다','보다','보다','보통','복잡하다','볼펜','봄','부르다','부모',
    '부모님','부부','부산','부엌','부인','북쪽','분','분','불','불고기','불다','비','비누','비디오','비빔밥','비슷하다','비싸다','비행기',
    '빠르다','빨간색','빨리','빵','사','사과','사다','사람','사랑','사랑하다','사무실','사십','사용하다','사월','사이','사장','사전','사진',
    '사탕','산','산책','살','살다','삼','삼십','삼월','새','새','색','색깔','샌드위치','생각','생각하다','생기다','생선','생일','생활',
    '샤워','서다','서로','서른','서울','서울역','서점','서쪽','선물','선물하다','선생','선생님','설명','설명하다','설악산','설탕','세',
    '세수','세탁기','센티미터','셋','셋째','셋째','소개하다','소금','소파','소풍','속','손','손가락','손님','쇠고기','쇼핑','수','수건','수박',
    '수업','수영','수영장','수요일','숙제','숟가락','술','술','쉬다','쉰','쉽다','슈퍼마켓','스무','스물','스키','스트레스','스포츠','슬프다',
    '시','시','시간','시간','시계','시원하다','시월','시작','시작되다','시작하다','시장','시험','식당','식사','식사하다','식탁','신다','신발',
    '실례','실례하다','싫다','싫어하다','십','십이월','십일월','싶다','싸다','싸우다','쓰다','쓰다','쓰다','쓰레기','씨','씻다','아','아기',
    '아내','아니','아니다','아니요','아들','아래','아름답다','아마','아무','아무','아버지','아빠','아이','아이스크림','아저씨','아주','아주머니',
    '아줌마','아직','아침','아파트','아프다','아홉','아흔','안','안','안경','안녕','안녕하다','안녕히','안다','안되다','앉다','않다','않다',
    '알다','앞','야구','약','약국','약속','약속하다','양말','양복','얘기','얘기하다','어','어깨','어느','어디','어디','어떠하다','어떤',
    '어떻다','어렵다','어른','어린이','어머니','어서','어제','어제','언니','언제','언제','언제나','얼굴','얼마','얼마나','엄마','없다',
    '에어컨','여권','여기','여덟','여동생','여든','여러','여러분','여름','여보세요','여섯','여자','여학생','여행','여행하다','역','역사',
    '연습','연습하다','연필','열','열다','열쇠','열심히','영국','영어','영화','옆','예','예쁘다','예순','옛날','오','오늘',
    '오다','오래','오래간만','오랜만','오렌지','오르다','오른쪽','오빠','오십','오월','오전','오후','올라가다','올해','옷','왜','왜냐하면',
    '외국','외국어','외국인','왼쪽','요리','요리하다','요일','요즈음','요즘','우리','우리나라','우산','우유','우체국','운동','운동장','운동하다',
    '운동화','운전','운전하다','울다','웃다','원','월','월요일','위','위험','위험하다','유명하다','유월','육','육십','은행','음식','음악','의사',
    '의자','이','이','이','이','이거','이것','이곳','이때','이런','이렇다','이름','이번','이분','이십','이야기','이야기하다','이월','이제',
    '이제','이쪽','이해하다','인사','인사','인사하다','인천','일','일','일','일곱','일본','일본어','일어나다','일요일','일월','일주일','일찍',
    '일하다','일흔','읽다','잃다','잃어버리다','입','입다','있다','있다','있다','잊다','잊어버리다','잎','자다','자동차','자리','자장면',
    '자전거','자주','작년','작다','잔','잘','잘하다','잠','잠깐','잠깐','잠시','잠자다','잡다','잡수시다','잡지','장','장미','장소','재미',
    '재미없다','재미있다','저','저','저','저거','저것','저곳','저기','저녁','저쪽','적다','적다','전','전','전화','전화번호','전화하다','점심',
    '점심시간','젓가락','정류장','정말','제일','제주도','조금','조금','조용하다','졸업','졸업하다','좀','종이','좋다','좋아하다','죄송하다',
    '주다','주다','주말','주소','주스','주인','죽다','준비','준비하다','중국','중국어','중요하다','중학교','중학생','즐겁다','지갑','지금','지금',
    '지난달','지난주','지내다','지도','지우개','지우다','지하','지하철','질문','질문하다','집','짜다','짧다','쪽','찌개','찍다','차','차','참',
    '창문','찾다','책','책상','처음','천','천','천천히','첫째','첫째','청바지','청소','청소하다','초대','초대하다','초등학교','초콜릿','추다',
    '축구','축하하다','출발하다','춤','춤추다','춥다','취미','층','치다','치마','치약','친구','친절하다','칠','칠십','칠월','칠판','침대',
    '칫솔','카드','카메라','칼','캐나다','커피','컴퓨터','컵','켜다','코','콜라','크다','크다','크리스마스','키','타다','태권도','태어나다',
    '택시','테니스','테이블','텔레비전','토요일','티브이','팀','파란색','파티','팔','팔','팔다','팔십','팔월','퍼센트','편지','포도','표',
    '프랑스','피곤하다','피아노','피우다','피자','필요','필요하다','하나','하나','하늘','하다','하다','하지만','학교','학년','학생','한',
    '한강','한국','한국말','한국어','한글','한번','한복','한자','할머니','할아버지','함께','항상','해','해','핸드폰','햄버거','허리','형',
    '호','호주','호텔','혼자','화','화요일','화장실','환자','회사','회의','후','휴일','휴지','휴지통','흰색','힘','힘들다'
);
$(function() {
    

    $('.btn_start').click(function() {
        $('.dimm').hide();
        userPoint = 0;
        removeCount = 0;
        $('.userpoint__val').text(userPoint);
        start(0, maxCounter, gameLevel); // 시작 카운터, 단어 최대갯수, 단어배열
    })
    $('.inputBox_inp').on('keyup',function(key){
        if(key.keyCode==13) {
            var inpVal = $('.inputBox_inp').val(); // 입력값 가져오기

            
            $('.treeBox__item').each(function(index, item) {
                if($(item).text() == inpVal) {
                    $(item).remove();
                    userPoint++;
                }
            });
            $('.userpoint__val').text(userPoint);
            $('.inputBox_inp').val(""); // 입력창 초기화
        }
    });
});

function createItem(word, level) {
    var checkCount = itemCount; // 단어 생성시 고유ID값 부여
    var topPos = 0; // 최초 생성 top 위치
    var leftPos = Math.floor(Math.random() * 80)+5; // 최초생성 left 위치

    // 단어요소생성
    $('.treeBox').append('<div class="treeBox__item lv'+level+' count'+ itemCount +'" style="left:'+ leftPos +'%">'+word+'</div>');
    itemCount++;

    var intervalId = setInterval(function() { // level에 따라 속도를 다르게하여 아래로 이동시킴
        posText = (topPos++) + '%';
        countLv = '.count' + checkCount;
        $(countLv).css('top',posText);
        
        if(topPos > 95) {
            clearInterval(intervalId);
            console.log('delete : ' + countLv);
            $(countLv).remove();
            removeCount++;
            if(removeCount >= maxCounter) { // 게임종료
                $('.dimm').show();
            }
        }
    }, level*100);
    
}

// 게임시작
function start(counter, maxcounter, wordLevel){
    var wordList, wordLeng;
    switch(wordLevel) {
        case '1' : 
            wordList = wordArr;
            break;
        case 2 :
            wordList = wordArr2;
            break;
        case 3 :
            wordList = wordArr2;
            break;
        default :
            wordList = wordArr;
    }
    wordLeng = wordList.length;
    
    var wordRand = Math.floor(Math.random() * wordLeng); // 단어 랜덤
    var wordLv = Math.floor(Math.random() * 5)+1; // 떨어지는 속도
    var wordDelay = Math.floor(Math.random() * 10)+5; // 단어 생성 주기

    if(counter < maxcounter){
        setTimeout(function(){
            counter++;
            console.log(wordList[wordRand],wordLv +'(LV)',wordDelay+'(delay)',' - ',counter+'/'+maxcounter);
            createItem(wordList[wordRand],wordLv); // 단어 생성
            start(counter, maxCounter, gameLevel);
        }, wordDelay*200);
    }
}
    